const express = require('express');
const path = require('path');

const app = express();

const schedule = {
    Monday: [
        'Разговор о важном',
        'Литература',
        'Обществознание',
        'Музыка',
        'Физкультура',
        'И. З. О.',
    ],
    Tuesday: [
        'Биология',
        'Русский язык',
        'Алгебра',
        'Геометрия',
        'Английский язык',
        'Физкультура',
        'География',
    ],
    Wednesday: [
        'Информатика',
        'Русский язык',
        'Русский язык',
        'Алгебра',
        'Физика',
        'Технология',
        'Технология',
    ],
    Thursday: [
        'География',
        'Русский язык',
        'Литература',
        'Геометрия',
        'Английский язык',
        'История',
        'История',
    ],
    Friday: [
        'Информатика',
        'Алгебра',
        'Теория вероятностей',
        'Английский язык',
        'Физкультура',
        'Физика',
        'История',
    ],
};

const homework = {
    'Разговор о важном': 'Домашнее задание по разговору о важном',
    'Литература': 'Домашнее задание по литературе',
    'Обществознание': 'Домашнее задание по обществознанию',
    // Добавьте домашнее задание для каждого предмета...
};

app.use(express.static(path.join(__dirname, 'public')));

app.get('/schedule', (req, res) => {
    res.json({ schedule, homework });
});

app.listen(3000, () => {
    console.log('Server is running on port 3000');
});